bookQuotes_app_backend/app/controllers/api/v1/books_controller.rb

    def update
        @book = Note.find(params[:id])
        @book.update(book_params)
---
UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", " by&nbsp; &nbsp; &nbsp;"], ["updated_at", "2020-01-26 15:24:12.788855"], ["id", 38]]