bookQuotes_app_backend/app/controllers/api/v1/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        book = Book.find_by_id(params[:id])

INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1"], ["author", "2"], ["created_at", "2020-01-22 22:06:31.654103"], ["updated_at", "2020-01-22 22:06:31.654103"]]
---
    def create

        book = Book.create(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Until We Reckon, Danielle"], ["updated_at", "2020-01-22 19:02:45.780696"], ["id", 4]]
---
    def update
        book = Book.find(params[:id])
        book.update(book_params)