bookQuotes_app_backend/app/controllers/api/v1/quotes_controller.rb

    def create

        book = Book.find(params[:book_id])
        quote = book.quotes.create(quote_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
INSERT INTO "quotes" ("book_id", "quote_text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 52], ["quote_text", "asdf"], ["created_at", "2020-01-28 00:19:41.251721"], ["updated_at", "2020-01-28 00:19:41.251721"]]